; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 2832)
	(= (fuel plane1) 604)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city0)
	(= (capacity plane2) 10419)
	(= (fuel plane2) 916)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 11)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 8)
	(at plane3 city3)
	(= (capacity plane3) 12840)
	(= (fuel plane3) 908)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 10)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 2)
	(at person1 city0)
	(at person2 city6)
	(at person3 city7)
	(at person4 city0)
	(at person5 city3)
	(at person6 city4)
	(at person7 city2)
	(at person8 city3)
	(at person9 city4)
	(at person10 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 963)
	(= (distance city0 city2) 546)
	(= (distance city0 city3) 811)
	(= (distance city0 city4) 705)
	(= (distance city0 city5) 916)
	(= (distance city0 city6) 700)
	(= (distance city0 city7) 632)
	(= (distance city1 city0) 963)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 559)
	(= (distance city1 city3) 993)
	(= (distance city1 city4) 529)
	(= (distance city1 city5) 602)
	(= (distance city1 city6) 585)
	(= (distance city1 city7) 515)
	(= (distance city2 city0) 546)
	(= (distance city2 city1) 559)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 871)
	(= (distance city2 city4) 928)
	(= (distance city2 city5) 582)
	(= (distance city2 city6) 871)
	(= (distance city2 city7) 784)
	(= (distance city3 city0) 811)
	(= (distance city3 city1) 993)
	(= (distance city3 city2) 871)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 880)
	(= (distance city3 city5) 573)
	(= (distance city3 city6) 709)
	(= (distance city3 city7) 899)
	(= (distance city4 city0) 705)
	(= (distance city4 city1) 529)
	(= (distance city4 city2) 928)
	(= (distance city4 city3) 880)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 503)
	(= (distance city4 city6) 522)
	(= (distance city4 city7) 756)
	(= (distance city5 city0) 916)
	(= (distance city5 city1) 602)
	(= (distance city5 city2) 582)
	(= (distance city5 city3) 573)
	(= (distance city5 city4) 503)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 608)
	(= (distance city5 city7) 947)
	(= (distance city6 city0) 700)
	(= (distance city6 city1) 585)
	(= (distance city6 city2) 871)
	(= (distance city6 city3) 709)
	(= (distance city6 city4) 522)
	(= (distance city6 city5) 608)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 767)
	(= (distance city7 city0) 632)
	(= (distance city7 city1) 515)
	(= (distance city7 city2) 784)
	(= (distance city7 city3) 899)
	(= (distance city7 city4) 756)
	(= (distance city7 city5) 947)
	(= (distance city7 city6) 767)
	(= (distance city7 city7) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city4)
	(at person2 city3)
	(at person3 city5)
	(at person4 city6)
	(at person5 city0)
	(at person6 city3)
	(at person7 city4)
	(at person8 city4)
	(at person9 city0)
	(at person10 city0)
	))

(:metric minimize (+ (* 1 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane3 city3)
   changed: (fuel plane3) from 908 to 12840
   goals met: 0 of 10
2. (board person5 plane3 city3)
   deleted: (at person5 city3)
   added: (in person5 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 0 of 10
3. (board person8 plane3 city3)
   deleted: (at person8 city3)
   added: (in person8 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 0 of 10
4. (zoom plane3 city3 city5)
   deleted: (at plane3 city3)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 0 to 5730, (fuel plane3) from 12840 to 7110
   goals met: 0 of 10
5. (refuel plane2 city0)
   changed: (fuel plane2) from 916 to 10419
   goals met: 0 of 10
6. (board person1 plane2 city0)
   deleted: (at person1 city0)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 0 of 10
7. (board person4 plane2 city0)
   deleted: (at person4 city0)
   added: (in person4 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 0 of 10
8. (fly plane2 city0 city6)
   deleted: (at plane2 city0)
   added: (at plane2 city6)
   changed: (total-fuel-used) from 5730 to 8530, (fuel plane2) from 10419 to 7619
   goals met: 0 of 10
9. (debark person4 plane2 city6)
   deleted: (in person4 plane2)
   added: (at person4 city6)
   changed: (onboard plane2) from 2 to 1
   goals met: 1 of 10
10. (fly plane2 city6 city4)
   deleted: (at plane2 city6)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 8530 to 10618, (fuel plane2) from 7619 to 5531
   goals met: 1 of 10
11. (debark person1 plane2 city4)
   deleted: (in person1 plane2)
   added: (at person1 city4)
   changed: (onboard plane2) from 1 to 0
   goals met: 2 of 10
12. (board person6 plane2 city4)
   deleted: (at person6 city4)
   added: (in person6 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 10
13. (board person10 plane3 city5)
   deleted: (at person10 city5)
   added: (in person10 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 2 of 10
14. (fly plane2 city4 city3)
   deleted: (at plane2 city4)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 10618 to 14138, (fuel plane2) from 5531 to 2011
   goals met: 2 of 10
15. (debark person6 plane2 city3)
   deleted: (in person6 plane2)
   added: (at person6 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 10
16. (fly plane3 city5 city4)
   deleted: (at plane3 city5)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 14138 to 16653, (fuel plane3) from 7110 to 4595
   goals met: 3 of 10
17. (board person9 plane3 city4)
   deleted: (at person9 city4)
   added: (in person9 plane3)
   changed: (onboard plane3) from 3 to 4
   goals met: 3 of 10
18. (refuel plane1 city4)
   changed: (fuel plane1) from 604 to 2832
   goals met: 3 of 10
19. (debark person8 plane3 city4)
   deleted: (in person8 plane3)
   added: (at person8 city4)
   changed: (onboard plane3) from 4 to 3
   goals met: 4 of 10
20. (fly plane3 city4 city0)
   deleted: (at plane3 city4)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 16653 to 20178, (fuel plane3) from 4595 to 1070
   goals met: 4 of 10
21. (debark person5 plane3 city0)
   deleted: (in person5 plane3)
   added: (at person5 city0)
   changed: (onboard plane3) from 3 to 2
   goals met: 5 of 10
22. (debark person9 plane3 city0)
   deleted: (in person9 plane3)
   added: (at person9 city0)
   changed: (onboard plane3) from 2 to 1
   goals met: 6 of 10
23. (debark person10 plane3 city0)
   deleted: (in person10 plane3)
   added: (at person10 city0)
   changed: (onboard plane3) from 1 to 0
   goals met: 7 of 10
24. (fly plane1 city4 city5)
   deleted: (at plane1 city4)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 20178 to 20681, (fuel plane1) from 2832 to 2329
   goals met: 7 of 10
25. (zoom plane1 city5 city2)
   deleted: (at plane1 city5)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 20681 to 21845, (fuel plane1) from 2329 to 1165
   goals met: 7 of 10
26. (board person7 plane1 city2)
   deleted: (at person7 city2)
   added: (in person7 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 7 of 10
27. (fly plane1 city2 city7)
   deleted: (at plane1 city2)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 21845 to 22629, (fuel plane1) from 1165 to 381
   goals met: 7 of 10
28. (board person3 plane1 city7)
   deleted: (at person3 city7)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 7 of 10
29. (refuel plane1 city7)
   changed: (fuel plane1) from 381 to 2832
   goals met: 7 of 10
30. (zoom plane1 city7 city5)
   deleted: (at plane1 city7)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 22629 to 24523, (fuel plane1) from 2832 to 938
   goals met: 7 of 10
31. (debark person3 plane1 city5)
   deleted: (in person3 plane1)
   added: (at person3 city5)
   changed: (onboard plane1) from 2 to 1
   goals met: 8 of 10
32. (fly plane1 city5 city4)
   deleted: (at plane1 city5)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 24523 to 25026, (fuel plane1) from 938 to 435
   goals met: 8 of 10
33. (debark person7 plane1 city4)
   deleted: (in person7 plane1)
   added: (at person7 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 10
34. (refuel plane1 city4)
   changed: (fuel plane1) from 435 to 2832
   goals met: 9 of 10
35. (fly plane1 city4 city6)
   deleted: (at plane1 city4)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 25026 to 25548, (fuel plane1) from 2832 to 2310
   goals met: 9 of 10
36. (board person2 plane1 city6)
   deleted: (at person2 city6)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 9 of 10
37. (fly plane1 city6 city3)
   deleted: (at plane1 city6)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 25548 to 26257, (fuel plane1) from 2310 to 1601
   goals met: 9 of 10
38. (debark person2 plane1 city3)
   deleted: (in person2 plane1)
   added: (at person2 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 10 of 10
